tutorials/incompressible/pimpleSolver/ras/TJunction/0/k
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.2;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;       // 5% turbulent intensity
        value           $internalField;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    outlet2
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    defaultFaces
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
