tutorials/incompressible/pimpleSolver/ras/TJunction/0/p
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            uniformTotalPressure;
        pressure        table
        (
            (0 10)
            (1 40)
        );
        p0              40; // only used for restarts
        U               U;
        phi             phi;
        rho             none;
        psi             none;
        gamma           1;
        value           uniform 40;
    }

    outlet1
    {
        type            fixedValue;
        value           uniform 10;
    }

    outlet2
    {
        type            fixedValue;
        value           uniform 0;
    }

    defaultFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
